Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/svd/PIC32CM1216LE00032.svd
               <register>
                  <name>PERBUF</name>
                  <description>COUNT32 Period Buffer</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                     <field>
                        <name>PERBUF</name>
                        <description>Period Buffer Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>CCBUF[%s]</name>
                  <description>COUNT32 Compare and Capture Buffer</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CCBUF</name>
                        <description>Counter/Compare Buffer Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC1</name>
         <baseAddress>0x42002000</baseAddress>
         <interrupt>
            <name>TC1</name>
            <description>Timer Counter 1</description>
            <value>56</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC2</name>
         <baseAddress>0x42002400</baseAddress>
         <interrupt>
            <name>TC2</name>
            <description>Timer Counter 2</description>
            <value>57</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TRAM</name>
         <version>U28012.0.0</version>
         <description>TrustRAM</description>
         <baseAddress>0x42005400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x6A0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TRAM</name>
            <description>Trust Ram</description>
            <value>70</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPERS</name>
                     <description>Tamper Erase</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SILACC</name>
                     <description>Silent Access</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>TrustRAM Readout Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ended Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>TrustRAM Readout Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ended Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>TrustRAM Readout Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ended</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RAMINV</name>
                     <description>RAM Inversion Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ongoing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy Status</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSCC</name>
               <description>Data Scramble Control</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DSCKEY</name>
                     <description>Data Scramble Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
                  <field>
                     <name>DSCEN</name>
                     <description>Data Scramble Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>128</dim>
               <dimIncrement>4</dimIncrement>
               <name>RAM[%s]</name>
               <description>TrustRAM</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Trust RAM Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>128</dim>
               <dimIncrement>4</dimIncrement>
               <name>RAM_BYTE_MODE[%s]</name>
               <description>TrustRAM</description>
               <alternateRegister>RAM[%s]</alternateRegister>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BYTE0</name>
                     <description>Trust RAM Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE1</name>
                     <description>Trust RAM Data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>Trust RAM Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE3</name>
                     <description>Trust RAM Data</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>128</dim>
               <dimIncrement>4</dimIncrement>
               <name>RAM_HALFWORD_MODE[%s]</name>
               <description>TrustRAM</description>
               <alternateRegister>RAM[%s]</alternateRegister>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HWORD0</name>
                     <description>Trust RAM Halfword Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>HWORD1</name>
                     <description>Trust RAM Halfword Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
